[
  {
    "id": "sitemap",
    "name": "Sitemap Diagram",
    "banner": "assets/images/process/ux/design/sitemap_a.jpg",
    "step": "Visualize the interaction",
    "type": "design",
    "properties": {
      "backgroundColor": "#fff176",
      "textColor": "#000000"
    },
    "links": [
      "https://theuxreview.co.uk/sitemaps-the-beginners-guide/",
      "https://speckyboy.com/collection-inspiring-sitemaps-user-flow-maps/"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "A Sitemap is a hierarchical diagram showing the structure of an application. They ensure content is in a logical place that users would expect to find it and can be used as a reference point for wireframes and user flows."
          },
          {
            "title": "Benefits",
            "list": [
              "Show how the navigation should be structured",
              "Help identify where content fits and what needs to be produced",
              "Clearly display the relationship between different pages"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Personas",
              "Journey Mapping",
              "Event Storming",
              "Story Mapping"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "Gather data from previous mapping activities. Ideally a lot of the work will already be done!",
              "If details are missing run a card sort session, writing down all page names on cards and sort them into categories",
              "From all gathered information create an initial mindmap with a hierarchical view of all pages",
              "Review this diagram against documented User Journeys to ensure the taxonomy support them",
              "Review whether all personas understand the labelling you have come up with",
              "Review if there are any categories that are too large or small and break them up where necessary",
              "Pages can then be ordered in terms of user interaction order to produce a Site Flow diagram if not too complex"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A Sitemap diagram that demonstrates the navigation layout and organisation of content",
              "A Site Flow diagram, showing roughly the order of user interaction for each page in a category"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/sitemap_b.png",
            "title": "Sitemap Example",
            "caption": "An example Sitemap"
          },
          {
            "url": "assets/images/process/ux/design/sitemap_c.png",
            "title": "Site Flow Example",
            "caption": "An example Site Flow"
          }
        ]
      }
    ]
  },
  {
    "id": "flow-diagrams",
    "name": "User Flow Diagrams",
    "banner": "assets/images/process/ux/design/user_flow_a.jpg",
    "step": "Visualize the interaction",
    "type": "design",
    "properties": {
      "backgroundColor": "#ffd54f",
      "textColor": "#000000"
    },
    "links": [
      "https://uxknowledgebase.com/user-flow-496e3187842",
      "https://signalvnoise.com/posts/1926-a-shorthand-for-designing-ui-flows",
      "https://uxplanet.org/ux-glossary-task-flows-user-flows-flowcharts-and-some-new-ish-stuff-2321044d837d",
      "https://uxdesign.cc/the-biggest-wtf-in-design-right-now-87139f367d66",
      "https://uxdesign.cc/when-to-use-user-flows-guide-8b26ca9aa36a"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "A User Flow is a sequence of steps the user needs to take in order to accomplish a task inside the application. Visualising these sequences helps to improve and simplify an existing process, or design an optimised flow and determine what information is required. ?It also helps to eliminate guesswork and ambiguity for the developer."
          },
          {
            "title": "Benefits",
            "list": [
              "Helps to determine if the current process is complete or if steps are missing",
              "Discover if the design can be simplified and whether the number of steps reduced",
              "Determine if each next step is obvious enough, or if further information is required",
              "Provides documentation for all user interactions"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Persona Workshop",
              "Journey Mapping",
              "Event Storming",
              "Sitemap Diagram"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "First list out all entry points into the application and possible landing pages",
              "For each persona create user flows using only text",
              "Each step should state what the user sees and what they do to progress to the next step",
              "Start with happy paths, then move onto edge cases and error paths",
              "From these flows draw sketches representing the UI so that each step can be more easily visualised",
              "Once confirmed these sketches can be digitised"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A set of diagrams documenting all user interactions with the application"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/user_flow_b.png",
            "title": "User Flow initial steps",
            "caption": "Initial text only user flow steps"
          },
          {
            "url": "assets/images/process/ux/design/user_flow_c.png",
            "title": "User Flow Direction",
            "caption": "User flows should only go in one direction and show possible outcomes"
          },
          {
            "url": "assets/images/process/ux/design/user_flow_d.png",
            "title": "User Flow Breakdown",
            "caption": "Flows should be broken down to show how individual goals are met"
          },
          {
            "url": "assets/images/process/ux/design/user_flow_e.png",
            "title": "Example User Flow",
            "caption": "An example User Flow diagram"
          }
        ]
      }
    ]
  },
  {
    "id": "wireframes",
    "name": "Wireframes & IX Flows",
    "banner": "assets/images/process/ux/design/wireframes_a.png",
    "step": "Communicate the idea",
    "type": "design",
    "properties": {
      "backgroundColor": "#ffb74d",
      "textColor": "#000000"
    },
    "links": [
      "https://www.experienceux.co.uk/faqs/what-is-wireframing/",
      "https://www.francoisfalcucci.fr/glossaire-ux-site-flow-flow-chart-user-flow-task-flow-wireflow-ix-flow/",
      "https://uxtricks.design/blogs/ux-design/wireframe-tools-and-rapid-prototyping/",
      "https://uxplanet.org/an-introduction-to-interaction-flows-a4f783402529",
      "https://dribbble.com/shots/861429-Wireflow"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "Wireframing is a way to design an application interface at the structural level. A wireframe is commonly used to lay out content and functionality on a page based on the previously defined User Flows. Wireframes help establish the basic structure of a page before visual design and content is added. Wireflows are used to show the relationship or flow between pages, while Interaction (IX) Flows define each interactive element’s trigger, feedback, rules, and loops/modes."
          },
          {
            "title": "Benefits",
            "list": [
              "Conveys the overall direction and description of the user interface",
              "A quick way to review and amend the structure of key pages based on user and business needs",
              "Great way of getting feedback from users and stakeholders",
              "IX Flows centralise the flow, visual design, and interactions in one document",
              "Reduces guesswork and ambiguity on the developer’s part"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Event Storming",
              "User Flows",
              "Sitemap Diagram"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "Based on the previously defined User Flows, mock up a wireframes for every page containing the key elements required by users to complete those flows",
              "Consider usability conventions, spacing and information hierarchy while designing wireframes",
              "Once wireframes have been completed Wireflows can be created by connecting each wireframe together with arrows to display user interactions and how their workflow causes them to navigate between pages",
              "Once all Wireflows have been completed a single Interaction flow can be produced",
              "Create a reference panel that defines the types of gestures and their representative symbols, definitions for terms used when describing interactions and a legend that defines the flow lines and other symbols",
              "Insert your wireframes with enough space for arrows and containers to fit around them",
              "For each wireframe interactive element add a reference box listing: the name and trigger with the matching icon, what feedback the user receives, what rules there are for what can and cannot be done and any different modes the element supports",
              "Connect wireframes with lines for connections between screens"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A series of individual wireframes for each core page of the application",
              "A series of Wireflows documenting the interactions between wireframes",
              "A single Interaction Flow documenting each interactive element’s trigger, feedback, rules, and loops/modes"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/wireframes_b.png",
            "title": "Wireframe Example",
            "caption": "A wireframe example"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_c.jpg",
            "title": "Another Wireframe Example",
            "caption": "Another wireframe example"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_d.jpg",
            "title": "Wireflow",
            "caption": "An example of a Wireflow"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_e.png",
            "title": "Another Wireflow",
            "caption": "Another example of a Wireflow"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_f.png",
            "title": "IX Flow Reference Panel",
            "caption": "An example of an Interaction Flow reference panel"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_g.png",
            "title": "IX Flow Wireframe",
            "caption": "An example of how a wireframe fits into an Interaction Flow"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_h.png",
            "title": "IX Flow Reference Box",
            "caption": "An example of an Interaction Flow reference box"
          },
          {
            "url": "assets/images/process/ux/design/wireframes_i.png",
            "title": "IX Flow Complete",
            "caption": "An complete example of an Interaction Flow"
          }
        ]
      }
    ]
  },
  {
    "id": "style-tile",
    "name": "Style Tile Design",
    "banner": "assets/images/process/ux/design/style_tile_a.jpg",
    "step": "Branding",
    "type": "design",
    "properties": {
      "backgroundColor": "#ff8a65",
      "textColor": "#000000"
    },
    "links": [
      "http://styletil.es/",
      "https://www.hongkiat.com/blog/style-guides-style-tiles/"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "Style Tiles consist of fonts, colors and interface elements that communicate the essence of a visual brand. They help form a common visual language between the designers and the stakeholders and provide a catalyst for discussions around the preferences and goals of the client."
          },
          {
            "title": "Benefits",
            "list": [
              "Help to nail down a specific aesthetic",
              "Establish a direct connection with actual interface elements without defining layout",
              "Help translate established brands smoothly to an interface",
              "Quick to produce without the need to create an entire style guide"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Stakeholder Interviews",
              "Event Storming"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "Research any existing company branding",
              "Have a design kickoff meeting involving stakeholders to get design ideas",
              "Interpret how the adjectives and themes discovered translate into design principles, such as balance and emphasis",
              "Determine themes from the aggregated adjectives and begin to match them up with styles",
              "Present multiple tiles and gather feedback for production of a new set of times",
              "Continue creating refined style tiles until an accepted core design language is agreed upon"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A set of potential style tiles",
              "An agreed style tile that defines the core design language going forwards"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/style_tile_b.png",
            "title": "Style Tile Example",
            "caption": "A Style Tile example"
          },
          {
            "url": "assets/images/process/ux/design/style_tile_c.jpg",
            "title": "Another Style Tile Example",
            "caption": "Another Style Tile example"
          },
          {
            "url": "assets/images/process/ux/design/style_tile_d.jpg",
            "title": "A Further Style Tile Example",
            "caption": "Yet another Style Tile example"
          }
        ]
      }
    ]
  },
  {
    "id": "design-systems",
    "name": "Design Systems",
    "banner": "assets/images/process/ux/design/design_systems_a.png",
    "step": "Branding",
    "type": "design",
    "properties": {
      "backgroundColor": "#e57373",
      "textColor": "#000000"
    },
    "links": [
      "https://medium.com/@whatjackhasmade/pattern-libraries-abcc45c6144c",
      "https://webdevstudios.com/2016/04/07/what-is-difference-between-style-guide-and-pattern-library",
      "https://www.hongkiat.com/blog/style-guides-style-tiles/",
      "https://www.toptal.com/designers/ui/ui-styleguide-better-ux",
      "https://www.uxpin.com/create-design-system-guide",
      "http://styleguides.io/examples"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "Design Systems encompass Style Guides (that define abstract styles) and Pattern Libraries (that define usable blocks) and also focus on defining rules and connections of an application. The goal is to create an asset that will stand the test of time, is open for additions and is accessible for anyone new to dive right into the guide with ease. In some cases a full Design System is required, in other cases a basic Style Guide will do."
          },
          {
            "title": "Benefits",
            "list": [
              "Record all design elements and interactions that occur within the application",
              "List crucial UI components such as buttons, typography, color and navigation menus",
              "Document important UX components like hover states, dropdown fills and animations",
              "Contain live elements and code snippets for developers to reference and use"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Style Tile Design"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "Create an existing UI inventory, including patterns, colors, typography, icons and spacing layouts",
              "Review the state of the existing inventory to discover inconsistencies, UX problems or issues negatively affecting the software development process",
              "Discuss with stakeholders the need for either a Style Guide, Pattern Library or Design System to eliminate raised issues",
              "Determine the technologies being used for the application and agree the best tools to use going forward",
              "If creating a Style Guide define the color palette, typography, icons and page structuring",
              "If creating a Pattern Library define reusable components, such as buttons, notifications, tables and forms",
              "If creating a Design System define the application rules and connections including motion, accessibility and taxonomies",
              "All these documents should be living and are not expected to cover all possibilities going forward. If new features are required later in development the Design System can be updated"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A defined Style Guide defining abstract styles",
              "A defined Pattern Library defining usable blocks",
              "A defined Design System defining rules and connections"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/design_systems_b.png",
            "title": "Design System Overview",
            "caption": "How Style Guides, Pattern Library and Design System relate to each other"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_c.png",
            "title": "Style Guide",
            "caption": "An example Style Guide"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_d.png",
            "title": "Another Style Guide",
            "caption": "Another Style Guide example"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_e.jpg",
            "title": "Pattern Library",
            "caption": "An example Pattern Library"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_f.png",
            "title": "Design System",
            "caption": "An example Design System"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_g.png",
            "title": "Another Design System",
            "caption": "Another example of a Design System"
          },
          {
            "url": "assets/images/process/ux/design/design_systems_h.gif",
            "title": "Yet Another Design System",
            "caption": "Yet another example of a Design System"
          }
        ]
      }
    ]
  },
  {
    "id": "high-fidelity-mockups",
    "name": "High Fidelity Mockups",
    "banner": "assets/images/process/ux/design/high_fidelity_mockups_a.jpg",
    "step": "Branding",
    "type": "design",
    "properties": {
      "backgroundColor": "#f06292",
      "textColor": "#000000"
    },
    "links": [
      "https://usabilitygeek.com/smart-ux-high%C2%AD-fidelity-wireframes/"
    ],
    "description": [
      {
        "type": "text",
        "content": [
          {
            "title": "Goal",
            "text": "High Fidelity Mockups are more complete representations of the application interface than Wireframes. The previously created Design System can be used to drag in elements and quickly produce an interface the very closely resembles the finished product. These mockups can even be made clickable and respond to the user’s actions, mimicking authentic interface interaction."
          },
          {
            "title": "Benefits",
            "list": [
              "Provides a clear idea as to how the interface will look and work",
              "Perfect for testing and gaining accurate feedback from the client",
              "Less likely to have errors when testing than a coded prototype"
            ]
          },
          {
            "title": "Prerequisites",
            "list": [
              "Wireframes & IX Flows",
              "Design Systems"
            ]
          },
          {
            "title": "The Process",
            "ordered": [
              "Gather previously designed wireframes and have the Design System at hand",
              "For each wireframe update the content following the Style Guide and using the components documented in the Design System",
              "Decide on software that mimics user interaction and connect the new High Fidelity Mockups using the defined IX Flows"
            ]
          },
          {
            "title":"Deliverables",
            "list": [
              "A set of High Fidelity Mockups for each previously produced Wireframe using the Design System",
              "A interactive demo with simulated clickable links between pages"
            ]
          }
        ]
      },
      {
        "type": "image",
        "content": [
          {
            "url": "assets/images/process/ux/design/high_fidelity_mockups_b.png",
            "title": "High Fidelity Mockup Example",
            "caption": "A High Fidelity Mockup example"
          },
          {
            "url": "assets/images/process/ux/design/high_fidelity_mockups_c.png",
            "title": "Another High Fidelity Mockup Example",
            "caption": "Another High Fidelity Mockup example"
          }
        ]
      }
    ]
  }
]
